package Arrays_Exercise;

import java.util.Scanner;


public class Demo1 {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        // MID EXAM
        // На първия ред ще получите последователност от елементи.
        // Всеки елемент в последователността ще има близнак. Докато
        //играчът получава "end" от конзолата, вие ще получите низове с две
        // цели числа, разделени с интервал,
        //представляващи индексите на елементите в последователността.
        //Ако играчът се опита да мами и въведе два равни индекса или индекси,
        // които са извън границите на последователността, вие
        //трябва да добавите два съответстващи елемента в средата на
        // последователността в следния формат:
        //"-{брой ходове до момента}a"
        //След това отпечатайте това съобщение на конзолата:
        //"Невалиден вход! Добавяне на допълнителни елементи към дъската"

        int lines = Integer.parseInt(scanner.nextLine());
        while (!"end".equals(lines)){

        }


    }
}


